-- MySQL dump 10.13  Distrib 5.5.34, for debian-linux-gnu (i686)
--
-- Host: localhost    Database: algorithmhome
-- ------------------------------------------------------
-- Server version	5.5.34-0ubuntu0.12.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `algorithm`
--

DROP TABLE IF EXISTS `algorithm`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `algorithm` (
  `id` varchar(36) NOT NULL COMMENT '主键，UUID',
  `name` varchar(45) NOT NULL COMMENT '算法名称',
  `summary` varchar(150) NOT NULL COMMENT '算法简介',
  `price` tinyint(4) NOT NULL COMMENT '算法标价',
  `code` varchar(36) NOT NULL COMMENT '算法源码ID',
  `iodata` varchar(36) NOT NULL COMMENT '输入输出ID',
  `thesis` varchar(36) NOT NULL COMMENT '论文ID',
  `buycount` int(11) NOT NULL DEFAULT '0' COMMENT '已购买次数',
  `status` tinyint(4) NOT NULL DEFAULT '4' COMMENT '1表示已删除，2表示未通过审核，3表示输入输出已审核,4表示待审核',
  `createtime` datetime NOT NULL COMMENT '发布时间',
  `uid` varchar(36) NOT NULL COMMENT '上传者ID',
  `cid` int(11) NOT NULL COMMENT '栏目ID',
  `mender` varchar(36) DEFAULT NULL COMMENT '操作者ID',
  `updatetime` datetime NOT NULL,
  `author1` varchar(45) DEFAULT NULL,
  `author2` varchar(45) DEFAULT NULL,
  `author3` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_algorithm_mender_idx` (`mender`),
  KEY `fk_algorithm_uid_idx` (`uid`),
  KEY `fk_algorithm_cid_idx` (`cid`),
  KEY `fk_algorithm_thesis_idx` (`thesis`),
  KEY `fk_algorithm_iodata_idx` (`iodata`),
  KEY `fk_algorithm_code_idx` (`code`),
  CONSTRAINT `fk_algorithm_cid` FOREIGN KEY (`cid`) REFERENCES `channel` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_algorithm_code` FOREIGN KEY (`code`) REFERENCES `attachment` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_algorithm_iodata` FOREIGN KEY (`iodata`) REFERENCES `attachment` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_algorithm_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_algorithm_thesis` FOREIGN KEY (`thesis`) REFERENCES `attachment` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_algorithm_uid` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `algorithm`
--

LOCK TABLES `algorithm` WRITE;
/*!40000 ALTER TABLE `algorithm` DISABLE KEYS */;
/*!40000 ALTER TABLE `algorithm` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `algorithmuser`
--

DROP TABLE IF EXISTS `algorithmuser`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `algorithmuser` (
  `aid` varchar(36) NOT NULL,
  `uid` varchar(36) NOT NULL,
  PRIMARY KEY (`aid`,`uid`),
  KEY `fk_algorithmuser_uid_idx` (`uid`),
  CONSTRAINT `fk_algorithmuser_aid` FOREIGN KEY (`aid`) REFERENCES `algorithm` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_algorithmuser_uid` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `algorithmuser`
--

LOCK TABLES `algorithmuser` WRITE;
/*!40000 ALTER TABLE `algorithmuser` DISABLE KEYS */;
/*!40000 ALTER TABLE `algorithmuser` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `attachment`
--

DROP TABLE IF EXISTS `attachment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `attachment` (
  `id` varchar(36) NOT NULL COMMENT '主键，UUID',
  `hash` varchar(45) NOT NULL COMMENT '七牛云存储返回的文件ID',
  `name` varchar(45) NOT NULL COMMENT '附件的名字，例如xxx.zip 、xxx.doc',
  `status` tinyint(4) NOT NULL DEFAULT '2' COMMENT '1表示已删除，2表示可用',
  `mender` varchar(36) DEFAULT NULL COMMENT '修改者ID',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_attachment_mender_idx` (`mender`),
  CONSTRAINT `fk_attachment_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `attachment`
--

LOCK TABLES `attachment` WRITE;
/*!40000 ALTER TABLE `attachment` DISABLE KEYS */;
/*!40000 ALTER TABLE `attachment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `channel`
--

DROP TABLE IF EXISTS `channel`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `channel` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键自增长',
  `name` varchar(20) NOT NULL COMMENT '栏目名称',
  `level` tinyint(4) NOT NULL COMMENT '1表示一级栏目，2表示二级栏目，3表示三级栏目',
  `cid` int(11) DEFAULT NULL COMMENT '父栏目ID',
  `mender` varchar(36) DEFAULT NULL COMMENT '修改者ID',
  `status` tinyint(4) NOT NULL COMMENT '1表示已删除，2表示可用',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `name_UNIQUE` (`name`),
  KEY `fk_channel_cid_idx` (`cid`),
  KEY `fk_channel_mender_idx` (`mender`),
  CONSTRAINT `fk_channel_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=729 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `channel`
--

LOCK TABLES `channel` WRITE;
/*!40000 ALTER TABLE `channel` DISABLE KEYS */;
INSERT INTO `channel` VALUES (38,'数学',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(39,'天文学',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(40,'计算机科学技术',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(41,'经济学',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(42,'地球科学',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(43,'物理学',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(44,'电子、通信与自动控制技术',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(45,'动力与电气工程',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(46,'力学',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(47,'统计学',1,NULL,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(48,'数学史',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(49,'数论',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(50,'代数学',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(51,'代数几何学',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(52,'拓扑学',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(53,'数学分析',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(54,'非标准分析',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(55,'函数论',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(56,'常微分方程',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(57,'偏微分方程',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(58,'动力系统',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(59,'积分方程',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(60,'计算数学',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(61,'概率论',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(62,'数理统计学',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(63,'应用统计数学',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(64,'运筹学',2,38,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(65,'天体力学',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(66,'天体物理学',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(67,'天体测量学',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(68,'射电天文学',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(69,'空间天文学',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(70,'天体演化学',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(71,'恒星与银河系',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(72,'太阳与太阳系',2,39,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(73,'计算机科学技术基础学科',2,40,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(74,'人工智能',2,40,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(75,'计算机系统结构',2,40,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(76,'计算机软件',2,40,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(77,'计算机工程',2,40,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(78,'计算机应用',2,40,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(79,'政治经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(80,'经济思想史',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(81,'经济史',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(82,'世界经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(83,'国民经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(84,'数量经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(85,'会计学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(86,'技术经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(87,'生态经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(88,'劳动经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(89,'城市经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(90,'资源经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(91,'物资经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(92,'工业经济学',2,41,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(93,'大气科学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(94,'固体地球物理学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(95,'空间物理学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(96,'地球化学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(97,'大地测量学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(98,'地质学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(99,'水文学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(100,'海洋科学',2,42,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(101,'声学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(102,'热学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(103,'光学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(104,'电磁学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(105,'无线电物理',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(106,'电子物理学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(107,'凝聚态物理学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(108,'等离子体物理学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(109,'原子分子物理学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(110,'原子核物理学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(111,'高能物理学',2,43,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(112,'电子技术',2,44,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(113,'半导体技术',2,44,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(114,'信息处理技术',2,44,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(115,'通信技术',2,44,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(116,'自动控制技术',2,44,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(117,'工程热物理',2,45,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(118,'热工学',2,45,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(119,'动力机械工程',2,45,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(120,'电气工程',2,45,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(121,'基础力学',2,46,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(122,'固体力学',2,46,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(123,'振动与波',2,46,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(124,'流体力学',2,46,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(125,'爆炸力学',2,46,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(127,'物理力学',2,46,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(128,'统计力学',2,46,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(129,'理论统计学',2,47,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(130,'经济统计学',2,47,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(131,'社会统计学',2,47,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(132,'环境与生态统计学',2,47,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(133,'国际统计学',2,47,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(134,'演绎逻辑学',3,48,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(135,'证明论',3,48,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(136,'递归论',3,48,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(137,'模型论',3,48,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(138,'公理集合论',3,48,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(139,'数学基础',3,48,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(140,' 初等数论',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(141,'解析数论',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(142,'代数数论',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(143,' 超越数论',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(144,'丢番图逼近',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(145,'数的几何',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(146,' 概率数论',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(147,'计算数论',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(148,'数论其他学科',3,49,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(149,'线性代数',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(150,' 群论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(151,'域论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(152,'李群',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(153,'李代数',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(154,' Kac-Moody代数',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(155,'环论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(156,'模论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(157,'格论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(158,'泛代数理论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(159,'范畴论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(160,'同调代数',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(161,'代数K理论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(162,'微分代数',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(163,'代数编码理论',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(164,'代数学其他学科',3,50,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(165,'几何学基础',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(166,'欧氏几何学',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(167,'非欧几何学',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(168,'球面几何学',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(169,'向量和张量分析',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(170,'仿射几何学',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(171,'射影几何学',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(172,'微分几何学',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(173,'分数维几何',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(174,'计算几何学',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(175,'几何学其他学科',3,51,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(176,'点集拓扑学',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(177,'代数拓扑学',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(178,'同伦论',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(179,'低维拓扑学',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(180,'同调论',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(181,'维数论',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(182,'格上拓扑学',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(183,'纤维丛论',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(184,'几何拓扑学',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(185,'奇点理论',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(186,' 微分拓扑学',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(187,'拓扑学其他学科',3,52,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(188,'微分学',3,53,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(189,'积分学',3,53,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(190,'级数论',3,53,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(191,'数学分析其他学科',3,53,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(192,'实变函数论',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(193,'单复变函数论',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(194,'多复变函数论',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(195,'函数逼近论',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(196,'调和分析',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(197,'复流形',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(198,'特殊函数论',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(199,'函数论其他学科',3,55,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(200,'定性理论',3,56,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(201,'稳定性理论',3,56,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(202,'解析理论',3,56,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(203,'常微分方程其他学科',3,56,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(204,'椭圆型偏微分方程',3,57,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(205,'双曲型偏微分方程',3,57,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(206,'抛物型偏微分方程',3,57,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(207,'非线性偏微分方程',3,57,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(208,'偏微分方程其他学科',3,57,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(209,'微分动力系统',3,58,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(210,'拓扑动力系统',3,58,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(211,'复动力系统',3,58,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(212,'动力系统其他学科',3,58,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(213,'线性算子理论',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(214,'变分法',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(215,'拓扑线性空间',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(216,'希尔伯特空间',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(217,'函数空间',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(218,'巴拿赫空间',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(219,'算子代数',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(220,'测度与积分',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(221,'广义函数论',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(222,'非线性泛函分析',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(223,'泛函分析其他学科',3,59,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(224,'插值法与逼近论',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(225,'常微分方程数值解',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(226,'偏微分方程数值解',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(227,'积分方程数值解',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(228,'数值代数',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(229,'连续问题离散化方法',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(230,'随机数值实验',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(231,'误差分析',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(232,'计算数学其他学科',3,60,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(233,'几何概率',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(234,'概率分布',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(235,'极限理论',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(236,'随机过程',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(237,'马尔可夫过程',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(238,'随机分析',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(239,'鞅论',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(240,'应用概率论',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(241,'概率论其他学科',3,61,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(242,'抽样理论',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(243,'假设检验',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(244,'非参数统计',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(245,'方差分析',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(246,'相关回归分析',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(247,'统计推断',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(248,'贝叶斯统计',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(249,'试验设计',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(250,'多元分析',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(251,'统计判决理论',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(252,'时间序列分析',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(253,'数理统计学其他学科',3,62,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(254,'统计质量控制',3,63,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(255,'可靠性数学',3,63,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(256,'保险数学',3,63,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(257,'统计模拟',3,63,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(258,'应用统计数学其他学科',3,63,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(259,'线性规划',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(260,'非线性规划',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(261,'动态规划',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(262,'组合最优化',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(263,'参数规划',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(264,'整数规划',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(265,'随机规划',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(266,'排队论',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(267,'对策论',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(268,'库存论',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(269,'决策论',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(270,'搜索论',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(271,'图论',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(272,'统筹论',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(273,'最优化',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(274,'运筹学其他学科',3,64,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(275,'摄动理论',3,65,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(276,'天体力学定性理论',3,65,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(277,'天体形状与自转理论',3,65,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(278,'天体力学数值方法',3,65,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(279,'天文动力学',3,65,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(280,'历书天文学',3,65,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(281,'天体力学其他学科',3,65,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(282,'理论天体物理学',3,66,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(283,'相对论天体物理学',3,66,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(284,'等离子体天体物理学',3,66,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(285,'高能天体物理学',3,66,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(286,'实测天体物理学',3,66,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(287,'天体物理学其他学科',3,66,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(288,'天文地球动力学',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(289,'基本天体测量学',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(290,'照相天体测量学',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(291,'射电天体测量学',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(292,'空间天体测量学',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(293,'方位天文学',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(294,'实用天文学',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(295,'天体测量学其他学科',3,67,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(296,'射电天体物理学',3,68,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(297,'射电天文方法',3,68,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(298,'射电天文学其他学科',3,68,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(299,'红外天文学',3,69,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(300,'紫外天文学',3,69,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(301,'X射线天文学',3,69,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(302,'r射线天文学',3,69,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(303,'中微子天文学',3,69,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(304,'空间天文学其他学科',3,69,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(305,'星系动力学',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(306,'星系天文学',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(307,'运动宇宙学',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(308,'星系际物质',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(309,'大爆炸宇宙论',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(310,'星系形成与演化',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(311,'宇宙大尺度结构起源与演化',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(312,'星系与宇宙学其他学科',3,70,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(313,'恒星物理学',3,71,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(314,'恒星天文学',3,71,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(315,'恒星形成与演化',3,71,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(316,'星际物质物理学',3,71,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(317,'银河系结构与运动',3,71,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(318,'恒星与银河系其他学科',3,71,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(319,'太阳物理学',3,72,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(320,'太阳系物理学',3,72,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(321,'太阳系形成与演化',3,72,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(322,'行星物理学',3,72,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(323,'行星际物理学',3,72,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(324,'陨星学',3,72,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(325,'太阳与太阳系其他学科',3,72,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(326,'自动机理论',3,73,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(327,'可计算性理论',3,73,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(328,'计算机可靠性理论',3,73,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(329,'算法理论',3,73,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(330,'数据结构',3,73,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(331,'数据安全与计算机安全',3,73,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(332,'计算机科学技术基础学科其他学科',3,73,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(333,'人工智能理论',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(334,'自然语言处理',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(335,'机器翻译',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(336,'模式识别',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(337,'计算机感知',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(338,'计算机神经网络',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(339,'知识工程',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(340,'人工智能其他学科',3,74,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(341,'计算机系统设计',3,75,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(342,'并行处理',3,75,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(343,'分布式处理系统',3,75,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(344,'计算机网络',3,75,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(345,'计算机运行测试与性能评价',3,75,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(346,'计算机系统结构其他学科',3,75,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(347,'软件理论',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(348,'操作系统与操作环境',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(349,'程序设计及其语言',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(350,'编译系统',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(351,'数据库',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(352,'软件开发环境与开发技术',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(353,'软件工程',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(354,'计算机软件其他学科',3,76,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(355,'计算机元器件',3,77,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(356,'计算机处理器技术',3,77,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(357,'计算机存储技术',3,77,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(358,'计算机外围设备',3,77,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(359,'计算机制造与检测',3,77,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(360,'计算机高密度组装技术',3,77,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(361,'计算机工程其他学科',3,77,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(362,'中国语言文字信息处理(包括汉字信息处理)',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(363,'计算机仿真',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(364,'计算机图形学',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(365,'计算机图象处理',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(366,'计算机辅助设计',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(367,'计算机过程控制',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(368,'计算机信息管理系统',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(369,'计算机决策支持系统',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(370,'计算机应用其他学科',3,78,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(371,'资本主义政治经济学',3,79,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(372,'社会主义政治经济学',3,79,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(373,'政治经济学其他学科',3,79,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(374,'中国经济思想史',3,80,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(375,'外国经济思想史',3,80,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(376,'马克思主义经济思想史',3,80,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(377,'经济思想史其他学科',3,80,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(378,'世界经济史',3,81,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(379,'中国经济史',3,81,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(380,'经济史其他学科',3,81,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(381,'国际经济关系',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(382,'国际贸易学',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(383,'国际货币经济学',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(384,'国际金融学',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(385,'国际投资学',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(386,'国际收支理论',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(387,'美国经济',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(388,'日本经济',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(389,'德国经济',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(390,'法国经济',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(391,'世界经济学其他学科',3,82,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(393,'国民经济计划学',3,83,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(394,'区域经济学',3,83,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(395,'消费经济学',3,83,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(396,'投资经济学',3,83,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(397,'国民经济学其他学科',3,83,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(398,'数理经济学',3,84,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(399,'经济计量学',3,84,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(400,'数量经济学其他学科',3,84,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(401,'工业会计学',3,85,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(402,'农业会计学',3,85,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(403,'商业会计学',3,85,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(404,'银行会计学',3,85,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(405,'交通运输会计学',3,85,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(406,'会计学其他学科',3,85,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(407,'工程经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(408,'工业技术经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(409,'农业技术经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(410,'能源技术经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(411,'交通运输技术经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(412,'建筑技术经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(413,'商业与物流技术经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(414,'技术进步经济学',3,86,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(415,'森林生态经济学',3,87,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(416,'草原生态经济学',3,87,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(417,'水域生态经济学',3,87,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(418,'城市生态经济学',3,87,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(419,'区域生态经济学',3,87,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(420,'生态经济学其他学科',3,87,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(421,'就业经济学',3,88,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(422,'劳动管理学',3,88,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(423,'劳动统计学',3,88,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(424,'劳动社会学',3,88,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(425,'劳动心理学',3,88,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(426,'劳动经济史',3,88,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(428,'城市经济管理学',3,89,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(429,'城市土地经济学',3,89,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(430,'市政经济学',3,89,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(431,'住宅经济学',3,89,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(432,'城郊经济学',3,89,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(433,'海洋资源经济学',3,90,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(434,'生物资源经济学',3,90,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(435,'矿产资源经济学',3,90,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(436,'能源经济学',3,90,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(437,'资源开发与利用',3,90,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(438,'物资经济理论',3,91,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(440,'物资管理学',3,91,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(441,'工业发展经济学',3,92,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(442,'工业企业经营管理学',3,92,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(443,'工业经济地理',3,92,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(444,'工业部门经济学',3,92,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(445,'工业经济史',3,92,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(446,'大气物理学',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(447,'大气化学',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(448,'大气探测',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(449,'动力气象学',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(450,'天气学',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(451,'气候学',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(452,'云与降水物理学',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(453,'应用气象学',3,93,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(454,'地球动力学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(455,'地球重力学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(456,'地球流体力学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(457,'地壳与地形变',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(458,'地球内部物理学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(459,'地声学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(460,'地热学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(461,'地电学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(462,'地磁学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(463,'放射性地球物理学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(465,'地震学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(466,'勘探地球物理学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(467,'计算地球物理学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(468,'实验地球物理学',3,94,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(469,'电离层物理学',3,95,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(470,'高层大气物理学',3,95,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(471,'磁层物理学',3,95,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(472,'空间物理探测',3,95,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(473,'空间环境学',3,95,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(474,'空间物理学其他学科',3,95,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(475,'元素地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(476,'有机地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(477,'放射性地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(478,'同位素地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(479,'生物地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(480,'地球内部化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(481,'同位素地质年代学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(482,'成矿地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(483,'勘探地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(485,'实验地球化学',3,96,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(486,'地球形状学',3,97,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(487,'几何大地测量学',3,97,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(488,'物理大地测量学',3,97,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(489,'动力大地测量学',3,97,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(490,'空间大地测量学',3,97,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(491,'行星大地测量学',3,97,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(492,'数学地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(493,'地质力学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(494,'动力地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(495,'矿物学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(496,'矿床学与矿相学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(498,'岩石学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(499,'岩土力学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(500,'沉积学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(501,'古地理学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(502,'古生物学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(503,'地层学与地史学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(504,'前寒武纪地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(505,'第四纪地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(506,'构造地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(507,'大地构造学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(508,'勘查地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(509,'水文地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(510,'遥感地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(511,'区域地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(512,'火山学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(513,'石油与天然气地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(514,'煤田地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(515,'实验地质学',3,98,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(516,'水文物理学',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(517,' 水文化学',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(518,'水文地理学',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(519,'水文气象学',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(520,'水文测量',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(522,'水文图学',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(523,'湖沼学',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(524,'河流学与河口水文学',3,99,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(525,'海洋物理学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(526,'海洋化学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(527,'海洋地球物理学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(528,'海洋气象学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(529,'海洋地质学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(530,'物理海洋学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(531,'海洋生物学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(532,'河口、海岸学',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(533,'海洋调查与监测',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(534,'海洋科学其他学科',3,100,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(535,'物理声学',3,101,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(536,'非线性声学',3,101,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(537,'量子声学',3,101,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(539,'超声学',3,101,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(540,'水声学',3,101,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(542,'应用声学',3,101,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(543,'热力学',3,102,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(544,'热物性学',3,102,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(545,'传热学',3,102,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(546,'几何光学',3,103,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(547,'物理光学',3,103,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(548,'非线性光学',3,103,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(549,'光谱学',3,103,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(550,'电学',3,104,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(551,'静电学',3,104,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(552,'静磁学',3,104,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(553,'电动力学',3,104,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(554,'电磁波物理',3,105,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(555,'量子无线电物理',3,105,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(556,'微波物理学',3,105,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(557,'超高频无线电物理',3,105,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(558,'统计无线电物理',3,105,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(559,'量子电子学',3,106,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(560,'电子离子与真空物理',3,106,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(561,'带电粒子光学',3,106,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(562,'电子物理学其他学科',3,106,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(563,'凝聚态理论',3,107,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(564,'金属物理学',3,107,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(565,'半导体物理学',3,107,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(566,'电介质物理学',3,107,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(567,'晶体学',3,107,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(568,'非晶态物理学',3,107,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(569,'液晶物理学',3,107,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(570,'热核聚变等离子体物理学',3,108,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(571,'低温等离子体物理学',3,108,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(572,'等离子体光谱学',3,108,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(573,'凝聚态等离子体物理学',3,108,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(574,'非中性等离子体物理学',3,108,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(575,'原子与分子理论',3,109,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(576,'原子光谱学',3,109,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(577,'分子光谱学',3,109,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(578,'波谱学',3,109,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(579,'原子与分子碰撞过程',3,109,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(580,'核结构',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(581,'核能谱学',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(583,'低能核反应',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(584,'中子物理学',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(585,'裂变物理学',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(586,'聚变物理学',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(587,'轻粒子核物理学',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(589,'重离子核物理学',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(590,'中高能核物理学',3,110,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(591,'基本粒子物理学',3,111,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(592,'宇宙线物理学',3,111,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(593,'粒子加速器物理学',3,111,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(594,'高能物理实验',3,111,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(595,'电子电路',3,112,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(596,'天线电波传播',3,112,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(597,'无线电技术',3,112,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(598,'微波技术',3,112,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(599,'敏感电子学',3,112,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(600,'微电子学',3,112,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(601,'仿真技术',3,112,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(602,'半导体测试技术',3,113,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(603,'半导体材料',3,113,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(604,'半导体器件与技术',3,113,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(605,'集成电路技术',3,113,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(606,'半导体加工技术',3,113,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(608,'信号检测',3,114,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(609,'参数估计',3,114,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(610,'数据处理',3,114,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(611,'语音处理',3,114,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(612,'图象处理',3,114,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(613,'有线通信技术',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(614,'无线通信技术',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(615,'光纤通信技术',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(616,'通信传输技术',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(617,'通信网络技术',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(618,'通信终端技术',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(619,'电信',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(620,'邮政',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(621,'邮电通信管理工程',3,115,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(622,'自动控制理论',3,116,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(623,'工程热力学',3,117,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(624,'工程传热、传质学',3,117,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(625,'燃烧学',3,117,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(626,'多相流动',3,117,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(627,'热工测量与仪器仪表',3,118,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(628,'制冷与低温工程',3,118,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(629,'供热工程',3,118,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(630,'工业锅炉',3,118,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(631,'蒸汽工程',3,119,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(632,'内燃机工程',3,119,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(633,'流体机械及流体动力工程',3,119,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(634,'喷气推进机与涡轮机械',3,119,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(635,'电工学',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(637,'电路理论',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(638,'电气测量技术及其仪器仪表',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(639,'电工材料',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(640,'电机学',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(641,'电器学',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(642,'电力电子技术',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(643,'高电压工程',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(644,'绝缘技术',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(645,'电热与高频技术',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(646,'超导电工技术',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(647,'发电工程',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(648,'输配电工程',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(649,'电力系统及其自动化',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(650,'电力拖动及其自动化',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(651,'用电技术',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(652,'电加工技术',3,120,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(653,'理论力学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(654,'理性力学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(655,'非线性力学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(656,'连续介质力学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(657,'摩擦学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(658,'柔性多体力学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(659,'陀螺力学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(660,'飞行力学',3,121,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(661,'弹性力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(662,'塑性力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(663,'粘弹性、粘塑性力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(664,'蠕变',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(665,'界面力学与表面力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(666,'疲劳',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(667,'损伤力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(668,'断裂力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(669,'散体力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(670,'细观力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(671,'电磁固体力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(672,'结构力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(673,'计算固体力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(674,'实验固体力学',3,122,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(675,'线性振动力学',3,123,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(676,'非线性振动力学',3,123,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(677,'弹性体振动力学',3,123,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(678,'随机振动力学',3,123,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(679,'振动控制理论',3,123,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(680,'固体中的波',3,123,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(681,'流体—固体耦合振动',3,123,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(682,'水动力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(683,'气体动力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(684,'空气动力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(685,'悬浮体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(686,'湍流理论',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(687,'粘性流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(688,'多相流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(689,'渗流力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(690,'物理—化学流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(691,'等离子体动力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(692,'电磁流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(693,'非牛顿流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(694,'流体机械流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(695,'旋转与分层流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(696,'辐射流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(697,'计算流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(698,'实验流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(699,'环境流体力学',3,124,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(700,'爆轰与爆燃理论',3,125,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(701,'爆炸波、冲击波、应力波',3,125,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(702,'高速碰撞动力学',3,125,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(703,'高压固体物理力学',3,127,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(704,'稠密流体物理力学',3,127,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(705,'高温气体物理力学',3,127,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(706,'多相介质物理力学',3,127,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(707,'临界现象与相变',3,127,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(708,'原子与分子动力学',3,127,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(709,'应用力学',3,128,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(710,'统计调查分析理沦',3,129,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(711,'统计核算理论',3,129,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(712,'统计监督理论',3,129,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(713,'统计预测理论',3,129,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(714,'统计逻缉学',3,129,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(715,'宏观经济统计学',3,130,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(716,'微观经济统计学',3,130,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(717,'教育统计学',3,131,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(718,'文化与体育统计学',3,131,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(719,'卫生统计学',3,131,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(720,'司法统计学',3,131,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(721,'社会福利与社会保障统计学',3,131,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(722,'生活质量统计学',3,131,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(723,'自然资源统计学',3,132,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(724,'环境统计学',3,132,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(725,'生态平衡统计学',3,132,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(726,'国际标准分类统计学',3,133,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(727,'国际核算体系与方法论体系',3,133,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2),(728,'国际比较统计学',3,133,'ba4c7a0e-21a4-4f2a-ad2b-055c52435160',2);
/*!40000 ALTER TABLE `channel` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `comment` (
  `id` varchar(36) NOT NULL COMMENT '主键，UUID',
  `content` varchar(45) NOT NULL COMMENT '评论的内容',
  `aid` varchar(36) NOT NULL,
  `uid` varchar(36) NOT NULL,
  `createtime` datetime NOT NULL COMMENT '发布时间',
  `updatetime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  `status` tinyint(4) NOT NULL COMMENT '1表示已删除，2表示可用',
  `mender` varchar(36) NOT NULL COMMENT '修改者ID',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_comment_uid_idx` (`uid`),
  KEY `fk_comment_aid_idx` (`aid`),
  KEY `fk_comment_mender_idx` (`mender`),
  CONSTRAINT `fk_comment_aid` FOREIGN KEY (`aid`) REFERENCES `algorithm` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_comment_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_comment_uid` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `meeting`
--

DROP TABLE IF EXISTS `meeting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `meeting` (
  `id` varchar(36) NOT NULL,
  `time` datetime NOT NULL,
  `name` varchar(25) NOT NULL,
  `url` varchar(45) NOT NULL,
  `createtime` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  `status` tinyint(4) NOT NULL COMMENT '1表示已删除，2表示可用',
  `mender` varchar(36) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_meeting_mender_idx` (`mender`),
  CONSTRAINT `fk_meeting_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `meeting`
--

LOCK TABLES `meeting` WRITE;
/*!40000 ALTER TABLE `meeting` DISABLE KEYS */;
/*!40000 ALTER TABLE `meeting` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `message`
--

DROP TABLE IF EXISTS `message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `message` (
  `id` varchar(36) NOT NULL,
  `content` varchar(100) NOT NULL,
  `status` tinyint(4) NOT NULL COMMENT '1表示已删除，2表示未接收，3表示已接收',
  `sender` varchar(36) NOT NULL,
  `receiver` varchar(36) NOT NULL,
  `createtime` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  `mender` varchar(36) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_message_sender_idx` (`sender`),
  KEY `fk_message_receiver_idx` (`receiver`),
  KEY `fk_message_mender_idx` (`mender`),
  CONSTRAINT `fk_message_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_message_receiver` FOREIGN KEY (`receiver`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_message_sender` FOREIGN KEY (`sender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `message`
--

LOCK TABLES `message` WRITE;
/*!40000 ALTER TABLE `message` DISABLE KEYS */;
/*!40000 ALTER TABLE `message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `moderatorinfo`
--

DROP TABLE IF EXISTS `moderatorinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `moderatorinfo` (
  `id` varchar(36) NOT NULL COMMENT '用户ID，外键',
  `title` varchar(45) NOT NULL COMMENT '职称',
  `degree` varchar(45) NOT NULL,
  `summary` varchar(100) NOT NULL,
  `approve` varchar(36) NOT NULL COMMENT '认证材料ID',
  `realname` varchar(45) NOT NULL,
  `cid` int(11) NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1表示待审核，2表示通过审核，3表示未通过审核',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_moderatorinfo_approve_idx` (`approve`),
  KEY `fk_moderatorinfo_cid_idx` (`cid`),
  CONSTRAINT `fk_moderatorinfo_cid` FOREIGN KEY (`cid`) REFERENCES `channel` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_moderatorinfo_approve` FOREIGN KEY (`approve`) REFERENCES `attachment` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_moderatorinfo_id` FOREIGN KEY (`id`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `moderatorinfo`
--

LOCK TABLES `moderatorinfo` WRITE;
/*!40000 ALTER TABLE `moderatorinfo` DISABLE KEYS */;
/*!40000 ALTER TABLE `moderatorinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `question`
--

DROP TABLE IF EXISTS `question`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `question` (
  `id` varchar(36) NOT NULL COMMENT '主键，UUID',
  `content` varchar(100) NOT NULL COMMENT '问题内容',
  `cid` int(11) NOT NULL COMMENT '栏目ID',
  `uid` varchar(36) NOT NULL,
  `rid` varchar(36) DEFAULT NULL COMMENT '答案ID',
  `gold` tinyint(4) NOT NULL,
  `createtime` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  `mender` varchar(36) NOT NULL,
  `status` tinyint(4) NOT NULL COMMENT '1表示已删除，2表示可用',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_question_uid_idx` (`uid`),
  KEY `fk_question_cid_idx` (`cid`),
  KEY `fk_question_mender_idx` (`mender`),
  KEY `fk_question_rid_idx` (`rid`),
  CONSTRAINT `fk_question_cid` FOREIGN KEY (`cid`) REFERENCES `channel` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_question_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_question_rid` FOREIGN KEY (`rid`) REFERENCES `reply` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_question_uid` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `question`
--

LOCK TABLES `question` WRITE;
/*!40000 ALTER TABLE `question` DISABLE KEYS */;
/*!40000 ALTER TABLE `question` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reply`
--

DROP TABLE IF EXISTS `reply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `reply` (
  `id` varchar(36) NOT NULL COMMENT '主键，UUID',
  `content` varchar(100) NOT NULL,
  `uid` varchar(36) NOT NULL,
  `qid` varchar(36) NOT NULL,
  `createtime` datetime NOT NULL,
  `updatetime` datetime NOT NULL,
  `status` tinyint(4) NOT NULL COMMENT '1表示已删除，2表示可用',
  `mender` varchar(36) NOT NULL COMMENT '操作者ID',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_reply_qid_idx` (`qid`),
  KEY `fk_reply_uid_idx` (`uid`),
  KEY `fk_reply_mender_idx` (`mender`),
  CONSTRAINT `fk_reply_mender` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_reply_qid` FOREIGN KEY (`qid`) REFERENCES `question` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_reply_uid` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reply`
--

LOCK TABLES `reply` WRITE;
/*!40000 ALTER TABLE `reply` DISABLE KEYS */;
/*!40000 ALTER TABLE `reply` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `id` varchar(36) NOT NULL COMMENT '主键，UUID',
  `username` varchar(20) NOT NULL COMMENT '用户名',
  `email` varchar(30) NOT NULL COMMENT '电子邮箱',
  `password` varchar(32) NOT NULL COMMENT '用username当作盐值，通过MD5算法加密',
  `status` tinyint(4) NOT NULL DEFAULT '3' COMMENT '1表示已删除，2表示禁用，3表示邮箱未激活，4表示可用',
  `type` tinyint(4) NOT NULL DEFAULT '3' COMMENT '1表示管理员，2表示版主，3表示注册用户',
  `createtime` datetime NOT NULL COMMENT '创建时间',
  `updatetime` datetime NOT NULL COMMENT '修改时间',
  `mender` varchar(36) DEFAULT NULL COMMENT '修改者ID',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `username_UNIQUE` (`username`),
  UNIQUE KEY `email_UNIQUE` (`email`),
  KEY `fk_user_uid_idx` (`mender`),
  CONSTRAINT `fk_user_uid` FOREIGN KEY (`mender`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('ba4c7a0e-21a4-4f2a-ad2b-055c52435160','algorithmhome','bingoogol@sina.com','6c338d25936e30900bad9a741dfcee5d',4,1,'2013-12-06 21:08:23','2013-12-06 21:08:23',NULL);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `userinfo`
--

DROP TABLE IF EXISTS `userinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `userinfo` (
  `id` varchar(36) NOT NULL COMMENT '用户ID，外键',
  `activecode` varchar(36) NOT NULL COMMENT '用户注册时的邮箱激活码，UUID',
  `expiretime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '激活码过期时间，时间戳，邮箱激活时判断激活码是否过期',
  `gold` tinyint(4) NOT NULL DEFAULT '5' COMMENT '用户拥有的金币，初始值是5',
  `cid` int(11) NOT NULL COMMENT '所关注领域的ID',
  `avatar` varchar(36) NOT NULL DEFAULT 'avatar' COMMENT '头像ID，外键关联attachment表',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_userinfo_cid_idx` (`cid`),
  KEY `fk_userinfo_avatar_idx` (`avatar`),
  CONSTRAINT `fk_userinfo_cid` FOREIGN KEY (`cid`) REFERENCES `channel` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_userinfo_avatar` FOREIGN KEY (`avatar`) REFERENCES `attachment` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_userinfo_id` FOREIGN KEY (`id`) REFERENCES `user` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `userinfo`
--

LOCK TABLES `userinfo` WRITE;
/*!40000 ALTER TABLE `userinfo` DISABLE KEYS */;
/*!40000 ALTER TABLE `userinfo` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2013-12-06 23:39:53
